Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/national_government/houses_of_the_oireachtas/work_of_a_td.html.txt.tmx
Source language: en
Languages: ga

source: Work of a TD
ga: Obair na dTeachtaí Dála

source: Members of Dáil Eireann are elected by a general election
ga: Toghann an pobal baill de Dháil Éireann le linn olltoghcháin

source: A TD (Teachta Dála) can be a member of a Government party, the Opposition or may sit as an independent TD
ga: Is féidir le TD (Teachta Dála) a bheith ina bhall den Rialtas, ina bhall den fhreasúra nó mar Theachta Dála neamhspléach

source: A TD represents everyone who is entitled to vote within their constituency
ga: Tá Teachta Dála ag déanamh ionadaíochta ar son gach duine ina D(h)áilcheantas atá i dteideal vóta a chaitheamh

source: A list of TDs, grouped alphabetically with their postal addresses, is available here
ga: Tá liosta Teachta Dála lena seoltaí phoist in ord aibítre ar fáil

source: A TD's work at Dáil Eireann involves meeting in plenary session on Tuesdays, Wednesdays, Thursdays and the first Friday in each month
ga: Cuid de obair an Teachta Dála i nDáil Éireann bualadh leis na Teachtaí go léir ar an Máirt, ar an gCéadaoin, ar an Déardaoin agus ar an chéad Aoine sa mhí

source: A typical day's work includes researching and preparing speeches for debates on social, economic, financial and budgetary issues
ga: Sa ghnáth lá oibre bheadh air nó uirthi taighde a dhéanamh, oráidí a ullmhú do dhíospóireacht Dála ar chúrsaí sóisialta, cúrsaí eacnamaíochta, nó ar chúrsaí airgid

source: Debates in the Dáil are chaired by the Ceann Comhairle
ga: Bíonn an Ceann Comhairle mar chathaoirleach ar dhíospóireachtaí Dála

source: View the official reports of all Dáil debates from 1919
ga: Tá na tuairiscí oifigiúla Dála ó 1919 ar fáil

source: TDs may also draft amendments to and examine proposals for new legislation
ga: Is féidir le Teachtaí Dála scrúdú a dhéanamh ar reachtaíocht nua agus leasuithe atá molta uirthi

source: TDs contribute to debates about new legislation and other important matters, they vote on issues in the House, they attend Question Time, they participate in Committee work and they make written or oral representations to ministers or government departments on behalf of their constituencies
ga: Bíonn Teachtaí Dála páirteach i ndíospóireachtaí tábhachtacha sa Dáil, caitheann siad vóta, bíonn siad i láthair do Am na gCeist bíonn siad ar choistí Dála agus cuireann siad ceisteanna scríofa nó béil chuig Airí nó Ranna Rialtais ar son a nDáilcheantar

source: There is a Committee system at Dáil Eireann
ga: Tá Córas Coistí i nDáil Éireann

source: Specialist Committees advise the Dáil on a broad range of legislative, social, economic and financial business
ga: Tugann Coistí ar Leith treoir don Rialtas ar réimhse leathan ábhair dlithiúla , sóisialta, eacnamaíochta agus airgid

source: Committees also examine Government expenditure
ga: Bíonn Coistí eile ag fiosrú caiteachas an Rialtais

source: Joint Committees are committees from both Dáil Eireann and the Seanad sitting and voting together
ga: Tugtar Comhchoistí ar na Coistí go bhfuil baill den Dáil agus den Seanad ag obair le chéile orthu agus ag caitheamh vóta le chéile

source: A TD will often be a member of more than one Committee
ga: Is minic go mbíonn Teachta Dála ar níos mó ná Coiste amháin

source: View a list and membership of all parliamentary committees here
ga: Tá liosta agus ballraíocht an uile Coistí ar fáil

source: As well as work at the Dáil and on Committees, TDs work within their own constituencies
ga: Is minic go bhfuil siad ar Údaráis áitiúla, ar bhoird sláinte agus ar Choistí Gairmoideachais

source: They hold regular advice clinics throughout their constituencies so that voters can meet them personally
ga: Bíonn clinicí eolais acu ina nDáilcheantair chun gur féidir leis na vótálaithe bualadh leo go pearsanta

source: Often they provide assistance to constituents with a family/personal problem relating to a government department
ga: Is minic go dtugann siad cúnamh do thoghdóirí fadhb phearsanta nó clainne a bhaineann le roinn rialtais a réiteach

source: If a TD breaches the rules of procedure or the Standing Orders at the Dáil, they may be disciplined
ga: Má bhriseann Teachta Dála cód oibre nó Rialacha Seasta na Dála is féidir go gcuirfí smacht air nó uirthi

source: In February 2002, the members of the Dáil adopted a Code of Conduct to ensure that their actions and decisions are taken in the best interests of the public
ga: I Feabhra 2002, glac na Teachtaí Dála Cód Iompair chun cinntiú go ndéanfaidh a ngníomhaithe agus a gcinntí de réir leas is fearr an pobal
